[Oreans]

&New = جديد
&Open... = فتح
&Save = حفظ
Save &As... = حفظ بٳسم
&Protect = حماية
&Help = مساعدة
About... = ...حول
Demo Version = ٳصدار غير كامل
Save = حغظ

Options = خيارات
Application Information = معلومات التطبيق
Protection Options = خيارات الحماية
Code Replace = Code تغيير
Virtual Machine = الألة الوهمية
Customized Dialogs = الحوارات المغيرة
Advanced Options = خيارات متقدمة
XBundler = XBundler
Help = مساعدة
Registration = التسجيل
Trial Settings = الإعدادات التجريبية
Hardware Lock = Hardware قفل
Password Protection = حماية كلمة السر
Soft&ware = البرنامج
&Customers = العملاء
&License Manager = مدير تراخيص الإستخدام
&Managers = المديرون
&Project = المشروع
Tools = الأدوات
H&elp = مساعدة
&Contents = المحتويات
&About = حول
Export Generators = تصدير المولدات
&Software = برنامج
&License = ترخيص الإستخدام
Password = كلمة السر
Trial Extension = الإمتداد التجريبى
&Exit = خروج
P&rotect = حماية
Open Project = فتح مشروع
New Project = مشروع جديد
Save Project = حفظ المشروع
Save Project As... = ...حفظ المشروع بإسم
Protect File = ملف الحماية
Dupli&cate = المتكررات
(Double click to select) = (أنقر مرتين لتختار)


Application = التطبيق
Version = الإصدار
Input Filename = إسم ملف الإدخال
Output Filename = إسم ملف الإخراج
File Size = حجم الملف
File Information = معلومات عن الملف
Get from version info = أحصل عليها من معلوماب الإصدار
File not found = الملف غير موجود
Refresh = تنشيط
Same as input = مماثل للإدخال

Advanced Anti-Debugger = المتقدم Anti-Debugger
Enable Protection = إتاحة الحماية
Advanced API-Wrapping = المتقدم API-Wrapping
Anti Dumpers = Anti Dumpers
Entry Point Obfuscation = تعتيم نقطة دخول البرنامج
Anti-Patching = Anti-Patching
None = لا شىء
File Patching = File Patching
Compression = الضغط
Resources = المصادر
Monitor Blockers = معوقات المراقبين
Files Monitors = مراقبي الملفات
Registry Monitors = مراقبي التسجيل
Delphi/BCB Form Protection = حماية Delphi/BCB Form
Resources Encryption = تشفير المصادر
VMWare/Virtual PC = VMWare/Virtual PC
Compatible = متوافق
When Debugger Found = Debugger حين العثور على
Enable Encryption = إتاحة التشفير
Display Message = الرسالة المعروضة
Exit Silently = الخروج بهدوء
Crash Application = تحطيم التطبيق
Metamorph Security = Metamorph أمان
Ring-0 Protection = Ring-0 حماية
(not available in DEMO) = (غير متاح فى الإصدار غير الكامل)

Import = إستيراد
Export = تصدير
Reset Messages = إعادة الرسائل

Global Caption = العنوان العام
Debugger found = Debugger تم العثور علي
Monitor software found = تم العثور علي برنامج مراقبة
Cracking tool found = تم العثور علي أداة كسر حماية
File corrupted = الملف تالف
(Not displayed in this version) = (لا تعرض في هذا الإصدار)
Internal exception occured =  حدث تعارض داخلى
Virtual Machine Detected = تم العثور علي ألة وهمية


Enable CodeReplace Technology = إتاحة تقنية تغيير الكود
Functions to remove using the CodeReplace Technology: = :الدوال المزالة بإستخدام تقنية تغيير الكود
Assembly code inside function: = :كود لغة التجميع داخل الدالة
Force simulation before protection = تشغيل المحاكاه قبل الحماية
Run with parameters = parameters العمل بواسطة
Start Simulation = إبدأ المحاكاه

Virtual API-Wrapper = إفتراضى API-Wrapper
Imported DLLs: = : المستوردة DLLs
Functions to Virtualize: = :دوال لتكون مفترضة
API Virtualization Level: = :درجة إفتراضية الدوال
Processor Specifications = مواصفات المعالج
Processor Type: = :نوع المعالج
Multiprocessor: = :تعدد وحدات المعالجة
Opcode Type: = :نوع Opcode
Dynamic Opcode: = :ديناميكى Opcode
VM Complexity: = :درجة تعقيد الألة الوهمية
VM size (aprox): = :(حجم الألة الوهمية (بالتقريب
Execution Speed: = :سرعة التنفيذ
Entry Point Virtualization = إفتراضية نقطة دخول البرنامج
Multi Branch Technology = تقنية تعدد الأفرع

Mutable CISC processor = متغير CISC processor
Mutable RISC-64 processor = متغير RISC-64 processor
Mutable RISC-128 processor = متغير RISC-128 processor
Mutable CISC-2 processor = متغير CISC-2 processor

Static opcodes = Static opcodes
Metamorphic - Level 1 = Metamorphic - المستوى ١
Metamorphic - Level 2 = Metamorphic - المستوى ٢
Metamorphic - Level 3 = Metamorphic - المستوى ٣

Disabled = منع
20% Dynamic = ٢٠٪ ديناميكى بنسبة 
40% Dynamic = ٤٠٪ ديناميكى بنسبة
60% Dynamic = ٦٠٪ ديناميكى بنسبة
80% Dynamic = ٨٠٪ ديناميكى بنسبة

Enable XBundler = XBundler إتاحة
Make files visible to OpenDialog = OpenDialog جعل الملفات مرئية ل
Allow bundling from any directory = directory دعم التحزيم من أى
AVI files support = AVI دعم ملفات
Deleted extracted on exit = مسح الملفات المستخرجة عند خروج البرنامج
Files to bundle: (drag files here) = (الملفات المكونة للحزمة: (إسحب الملفات و ألقها هنا
XBundler Options = XBundler خصائص
Add File = إضافة ملف
Delete File = مسح ملف

Filename = إسم الملف
Write to disk? = السماح بالكتابة للقرص؟
Extraction Path (if written to disk) = (مسار الإستخراج(إذا سمح بالكتابة للقرص


Encrypt Application = تشفير التطبيق
Protect as DLL Plugin = DLL Plugin حماية تشبه 
Protect DLL plugin = DLL Plugin حماية 
Last Section Name = إسم أخر قطاع
.NET assemblies = .NET assemblies
Active Context = تنشيط المحتوى
Enable support = إتاحة الدعم
Splash screen settings = خصائص النافذة البارزة
Mouse Click to proceed = نقرة بالفأرة للإستكمال
Display during a number of seconds = مدة العرض بالثوانى

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = .هذا الإختيار يسمح بتشفير البرنامج الذى تقوم بحمايته.يجب عدم إزالته إلا لأغراض إكتشاف الأخطاء

Check this option only if your protected DLL will be used as plugin in third party software. = .third party فى برنامج plugin سوف يستخدم كأنه DLL قم بهذا الإختيار فقط إذا كان ملف

You can change the name of the last section added by Themida = Themida يمكنك تعيير إسم القطاع الذى أضافه

This option should always be enabled to protect your .NET assemblies = الخاصة بك .NET assemblies هذا الإختيار يقوم بحماية

Support for Active Context based DLLs = ذات المحتوي النشط DLLs الدعم الخاص بملفات

Select a BMP-8 image that will be displayed when your application is launched = ليتم عرضها عند بداية تشغيل البرنامج BMP-8 إختر صورة

The user must click in the Splash Screen to continue running the protected application = يجب على المستخدم نقر النافذة البارزة قبل إستكمال العمل

The splash screen will be displayed for a custom number of seconds before continue running the protected application = النافذة البارزة سوف تعرض لعدد معين من الثوانى قبل إستكمال العمل

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = سيتغير بتغيير هذا الإختيار Hardware ID والذى سبتم إستخلاصه عند بداية العمل.لاحظ أن device driver والذى يقوم بتعزيز المعلومات المخزنة فى نظام التشغيل.إذا قمت بإختباره سيتم إدماج Ring-0 فى Trial و Licensing هذا الإختيار يتيح الحماية بنظامى


Reading SDK Macros = SDK Macros قراءة
Redirecting and Encrypting SDK Macros = SDK Macros إعادة توجيه وتشفير
Merging sections / Preparing PE Header = PE Header دمج القطاعات/إعداد
Examining and Wrapping API Calls = API فحص و إخفاء نداءات دوال
Generating Unique SecureEngine Code = منفرد SecureEngine Code توليد
Linking SecureEngine Code with Application = بالبرنامج SecureEngine Code ربط
Generating Unique Virtual Machine = توليد ألة وهمية منفردة
Compressing Virtual Machine = ضغط الألة الوهمية
Virtualizing VM / CodeReplace Macros = Virtualizing VM / CodeReplace Macros
Compressing Application and Resources = ضغط البرنامج و المصادر
Encrypting Application and Resources = تشفير البرنامج و المصادر

Test Protected File = إختبار الملف الذى تمت حمايته
Protect = حماية
Cancel = إلغاء
Play sound when protection finishes = إصدار صوت عند إنتهاء عملية الحماية

This option supervises at any time if your application is running under any kind of debugger. = .في أى وقت debugger هذا الإختيار يتأكد من عدم وضع البرنامج تحت سيطرة 
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = المتقدمة dumping للبرنامج حتى بإستخدام أدوات dump هذا الإختيار يمنع عمليات 
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = هذا الإختيار يقوم بإزالة و تشفير نقطة دخول البرنامج مع تشغيلها من مكان أكثر أمان فى الذاكرة
This option will keep your application resources fully encrypted against modifications = هذا الإختيار يجعل مصادر البرنامج مشفرة ضد محاولات التعديل
If you want that your application will run inside VMWare/VirtualPC you must check this option = فقم بإختيار  هذا الإختيار VMWare/VirtualPC إذا أردت أن يعمل البرنامج داخل
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = المستخدمة بواسطة البرنامج لمنع أى إحتمال لإعادة بناء البرنامج الأصلى API هذا الإختيار يقوم بإخغاء دوال
This option detects if any modification is done to your protected application, either by a cracker or a virus = أو فيروس cracker هذا الإختيار يقوم بأكتشاف أى تغيير يتم للبرنامج المحمى؛ بواسطة
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = محولة لقطاع معين فى البرنامج opcodes لتوليد Metamorph هذا الإختيار يقوم بتنشيط محرك
This option will protect your application against memory patching = memory patching هذا الإختيار يقوم بحماية البرنامج ضد
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory =  فى الذاكرة cracking أو أداة debugger هذا الإختيار يمكنك من تحديد الإجراء المتبع عند إكتشاف
This option keeps your application code compressed meanwhile it is not executed = هذا الإختيار يجعل الجزء الغير منفذ من البرنامج مضغوط
This option keeps the resources in your application fully compressed = هذا الإختيار يجعل المصادر فى البرنامج مضغوطة بالكامل
This option will compress the SecureEngine code that is appended into your protected application = المدمج مع البرنامج مضغوط SecureEngine code هذا الإختيار يجعل
This option will detect/fool possible files monitors when your protected application is running = هذا الإختيار يكتشف/يخدع برامج مراقبة الملفات عند تشغيل البرنامج
This option will detect/fool possible registry monitors when your protected application is running = هذا الإختيار يكتشف/يخدع برامج مراقبة التسجيل عند تشغيل البرنامج
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = Delphi/BCB ضد إعادة البناء من الذاكرة.لاحظ أن هذا الإختيار غير متوافق مع بعض برامج Delphi/BCB forms هذا الإختيار يقوم بحماية
Load your customized messages from a file = حمل رسالتك من ملف
Save your customized messages to a file = إحفظ رسالتك إلى ملف
This list displays all the DLLs imported by your application = المستوردة بواسطة البرنامج DLL هذه القائمة تعرض كل ملفات
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = المختار.يمكنك إختيار الدوال التى ستحول إلى "إفتراضية"َ DLL هذه القائمة تعرض كل الدوال المستوردة بواسطة ملف
You can import API names from a text file. The imported APIs will be virtualized in the current project = من ملف.الدوال المستوردة ستحول إلى دوال إفتراضية API يمكنك إستيراد أسماء دوال
Select the maximun number of instructions to virtualize from your application entry point = إختر الحد الأقصى لعدد التعليمات لجعلها واقعية من نقطة دخول البرنامج
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = داخل الألة الوهمية مما يجعلها أصعب فى التحليل conditional branch هذا الإختيار يزيد تعليمات
You can save the current selected APIs into a text file to be imported by another project = المختارة إلى ملف نصى لإستيرادها بواسطة مشروع أخر API يمكنك حفظ دوال
Complexity level to emulate each wrapped API = مخفاه API مستوى التعقيد لمحاكاة كل دالة

Changes have been made. Do you want to save project? = لقد حدثت تغييرات.هل تريد حفظ المشروع؟
Save Changes = إحفظ التغييرات

*UNSAVED* = *غير محفوظ*
Invalid Project File. Please, recreate a new one = ملف المشروع تالف.من فضلك إنشإ مشروع جديد
Load Project = تحميل مشروع
You need XBundler .NET for your .NET application. Please contact info@oreans.com = info@oreans.com برجاء الإتصال. .NET من أجل برامج XBundler .NET أنت فى حاجة إلى
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = هل تريد التحديث الأن؟. .NET لتدعيم Themida Professional أنت بحاجة للتحديث إلى. .NET لا يمكنه حماية ملفات Themida Standard ، عفوآ
Save Project = حفظ المشروع
Save Project As... = ...حفظ المشروع بإسم
No file selected. Please select a file to protect (Input Filename) =  (لم يتم إختيار ملف بعد.من فضلك إختر الملف المراد حمايته(أدخل إسم ملف
No Output file selected. Please select an Output file before protecting = لم يتم إختيار ملف الإخراج بعد.من فضلك إختر ملف الإخراج قبل البدء في الحماية
File does not exists: = :الملف غير موجود
File is already protected/compressed: = :الملف محمىٍ/مضغوط بالفعل
File has invalid macros insertion: = :مدخلة غير صحيحة macros الملف يحتوى على
Please, review your macros again = مرة أخرى macros من فضلك مراجعة 
File cannot be accessed for protection: = :لا يمكن الوصول للملف لحمايته
Please select a new file to protect (Input Filename) = (من فضلك إحتر ملف جديد لحمايته (أدخل إسم ملف
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = "لم يتم محاكاة الملف بعد. من فضلك قم بمحاكاة الملف قبل الحماية أو قم بإزالة الإختيار"تشغيل المحاكاه قبل الحماية
Open Input File = فتح ملف إدخال
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = للبرنامج. موافق؟ header لإعادة بناء Themida جزء المصادر فارغ قى البرنامج.يحتاج
Rebuild Header = Header إعادة بناء
File is compressed or already protected: = :الملف مضغوط أو محمى بالفعل
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = يبدو أن البرنامج مستخدم أو يعمل فى الذاكرة. من فضلك تأكد من إغلاقه قبل الإستكمال
Error = خطأ
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = هل تريد إعادة بناءه؟ .Themida البرنامج غير متوافق مع header
.NET limitation = .NET حدود
Sorry, you cannot change the global message caption in demo version = عفوآ، لا يمكنك تغيير إسم الرسالة العامة فى النسخة الغير كاملة
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = غير متوافقة مع الملف المختار وتمت إزالتها CodeReplace macros ،!تحذير
Warning = تحذير
Warning! The current application is already protected/compressed. Do you still want to protect it? = تحذير!البرنامح الحالى محمى / مضغوط بالفعل.هل لازلت تريد حمايته؟
File has a missing macro START or END: = :مفقودة فى الملف START أو END macro
Please review your macros again = مرة أخرى macros من فضلك مراجعة
File cannot be opened: = :لا يمكن فتح الملف
Make sure that other application is not using it = !تأكد من عدم إستخدام برامج أخرى له
File to protect has an invalid PE header. Unable to inspect file = تالف. لا يمكن فحص الملف PE heade الملف المراد حمايته يحتوى على
File to protect contains one macro with few lines of code on it. Please review your macros again = مرة أخرى macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = Visual Basic Pcode فى برامج CodeReplace لا يدعم Themida عفوآ، الإصدار الحالى من
Sorry, the current version of Themida does not support CodeReplace in .NET applications = .NET فى برامج CodeReplace لا يدعم Themida عفوآ، الإصدار الحالى من
Unable to find a function to add CodeReplace technology = CodeReplace لا يمكن إيجاد دالة لإضافة تقنية
Run with parameters = parameters العمل بواسطة
Please enter the parameters = parameters من فضلك أدخل
Sorry, you cant disable that option in demo version = عفوآ، لا يمكنك إزالة هذا الإختيار فى النسخة الغير كاملة
Messages exported to = الرسالة مصدرة إلى
Messages imported from = الرسالة مستوردة من
Themida GUI Overview = Themida GUI حول
Protect Now = إحمى الأن
SecureEngine Technology = SecureEngine تقنية
SecureEngine Macros = SecureEngine Macros
Code Replace = تغيير كود
Software Updates = تحديثات البرنامج
What is XBundler = XBundler ما هو
Using XBundler = XBundler إستخدام

Scenarios for Using XBundler = XBundler حوارات لإستخدام
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = ***(١ خطأ: ملف المشروع غير موجود أو تالف.(كود الخروج***
*** ERROR: File to protect does not exist. (Exit code 2) *** = ***(٢ خطأ: الملف المراد حمايته غير موجود.(كود الخروج***
*** ERROR: File is already protected. (Exit code 3) *** = ***(٣ خطأ: الملف محمي بالفعل.(كود الخروج***
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = *** (من فضلك قم بمراجعتهم مرة أخرى(كود الخروج ٤ .SecureEngine macros خطأ: خطأ فى***
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = ***(٢ خطأ: لا يمكن فتح الملف المراد حمايته.(كود الخروج***
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = *** فقط يتم عرضها بشكل صحيح BMP 256 خطأ:ملف الصورة لا يحتوى على 256 لون.ملفات***
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = ***الغير مضغوطة فقط يتم عرضها بشكل صحيح BMP مضغوط.ملفات BMP خطأ:ملف الصورة***
Macros found: = :التى تم العثور عليها Macros
*** Fatal error while protecting file. (Exit Code 5) *** = ***(خطأ أثناء حماية الملف(كود الخروج ٥***
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = ***(٦ خطأ: لا يمكن كتابة الملف المحمى.تأكد أت الملف غبر مستخدم.(كود الخروج***
Generating Unique SecureEngine Code... = ...منفرد SecureEngine توليد كود
Linking SecureEngine Code with Application... = ...بالبرنامج SecureEngine ربط كود
done. = .تم
Encrypting Application and Resources... = ...تشفير البرنامج و المصادر
Compressing Application and Resources... = ...ضغط البرنامج و المصادر
Macros processed: = :التى تمت معالجتها Macros

processed: = :تمت معالجتها
Application successfully protected. = .تمت حماية البرنامج بنجاح
Do you want to go to the order form Themida subscription plans? = ؟Themida هل تريد الذهاب إلى إطار خطط إشتراك
No file selected. Please, select a file to protect (Input Filename) = (لم يتم إختيار ملف بعد.من فضلك إختر ملف لحمايته(أدخل إسم ملف
Question = سؤال
-- Files to Bundle -- = --الملفات المراد وضعها فى الحزمة--
The path of the file that you are inserting must be relative to: = :مسار الملف يجب أن يكون نسبى بالنسبة إلى
All imported by ordinal! = .تم إستيراد الكل عن طريق الأصلى
Medium = متوسط
Normal = عادى
High = مرتفع
Supreme = مرتفع جدآ
Extreme = شديد
Highest = الأعلى

This option is not enabled in DEMO version = هذا الإختيار غير متاح في النسخة الغير كاملة
DEMO Restriction = قيود النسحة الغير كاملة
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = فقط يتم عرضها بشكل صحيح BMP 256 ملف الصورة لا يحتوى على 256 لون.ملفات
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = الغير مضغوطة فقط يتم عرضها بشكل صحيح BMP مضغوط.ملفات BMP ملف الصورة
Sorry, Themida DEMO does not support RISC-128 processors = RISC-128 لا يدعم معالجات Themida DEMO ، عفوآ
Processor Type = نوع المعالج
Sorry, Themida DEMO does not support Dynamic Opcodes = الديناميكية Opcodes لا يدعم معالجات Themida DEMO ، عفوآ
The file is never extracted to disk! = !لم يتم إستخلاص الملف إلى القرص مطلقآ
Select file/s to bundle = إختر الملف / الملفات المراد وضعها فى الحزمة
No file selected. Please, select a file to protect (Input Filename) = (لم يتم إختيار ملف بعد.من فضلك إختر ملف لحمايته(أدخل إسم ملف
Last Modified: = :أخر تعديل
(Application header has been rebuilt by Themida) = (Themida البرنامج تم إعادة بناءه عن طريق header)
File Type: Windows Standard Executable = Windows Standard Executable :نوع الملف
File Type: Visual Basic Native Executable = Visual Basic Native Executable :نوع الملف
File Type: Visual Basic PCode Executable = Visual Basic PCode Executable :نوع الملف
File Type: Windows .NET Executable = Windows .NET Executable :نوع الملف
File Type: MACROMEDIA Executable = MACROMEDIA Executable :نوع الملف
File Type: PowerBuilder Application = PowerBuilder Application :نوع الملف
File Type: Excelsior JET Application = Excelsior JET Application :نوع الملف
File Type: Dynamic Link Library (DLL) = Dynamic Link Library (DLL) :نوع الملف
File Type: OLE Control Extension (OCX) File = OLE Control Extension (OCX) :نوع الملف
File Type: Screensaver File = Screensaver File :نوع الملف
File Type: Windows NT Service = Windows NT Service :نوع الملف
File Type: Borland Library = Borland Library :نوع الملف
File Type: Linux Executable (ELF/i386) = Linux Executable (ELF/i386) :نوع الملف
File Type: NT Device Driver = NT Device Driver :نوع الملف

*** Protected with Code Virtualizer *** = ***تمت الحماية بطريقة إفتراضية الكود***
Virtual Machine Macro Functions: = :الألة الوهمية Macro دوال
CodeReplace Macro Functions: = :CodeReplace Macro دوال
CodeEncrypt Macro Functions: = :CodeEncrypt Macro دوال
ClearCode Macro Functions: = :ClearCode Macro دوال
Registered Macro Functions: = :المسجلة Macro دوال
Unregistered Macro Functions: = :الغير المسجلة Macro دوال
Read functions automatically = قراءة الدوال أوتوماتيكيآ
Read functions from SDK = SDK قراءة الدوال من
File already protected/compressed. = .الملف محمىٍ/مضغوط بالفعل
Error: There is a missing START or END in one of your macros. = مفقودة فى الملف START أو END macro:خطأ
Error: Unable to open the selected file. File may be in use. = .خطأ:لا يمكن فتح الملف المختار.ربما يكون مستخدم
Error: Invalid PE header in selected file. = .فى الملف المختار خاطئ PE header :خطأ
Error: The included code inside a macro is too small. = .صغير جدآ macro خطأ: الكود المحتوى داخل
Error: There are at least a nested VM macros. VM macros cannot be nested. = .لا يمكن أن تتداخل VM macros .متداخلة VM macros خطأ: على الأقل توجد 
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. = .لحماية هذا البرنامج Themida x32 أنت محتاج .x64 خطأ: البرنامج المختار ليس برنامج
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = .لحماية هذا البرنامج Themida x64 أنت محتاج .x64 خطأ: البرنامج المختار برنامج 
Project: = :المشروع
Select functions from MAP file = MAP إختر دوال من ملف
Read functions automatically = قراءة الدوال أوتوماتيكيآ
How many functions do you want to add? = كم عدد الدوال المراد إضافتها؟
OK = نعم
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = جديد للبرنامج MAP غير موجود. من فضلك قم بتوليد ملف MAP عفوآ ،ملف
There are not functions to simulate. Please, insert some functions either manually or automatically = لا يوجد دوال للمحاكاه.من فضلك قم بإضافة بعض الدوال يدويآ أو أوتوماتيكيآ
Simulator = محاكاة
Information = معلومات
None = لا شئ
Message = رسالة
Customize Dialog = تعديل المربع الحواري
Close = إغلاق

Internal Protection Messages = رسائل الحماية الداخلية
Trial/Registration Messages = Trial/Registration رسائل
Will be displayed by WinLicense = WinLicense سوف يتم عرضها عن طريق
Displayed by SDK or not displayed = أو لم يتم عرضها SDK تم عرضها عن طريق
Cannot update oreans.sys driver (admin rights) = (الحقوق الإدارية) oreans.sys driver لا يمكن تحديث
Cannot open oreans.vxd driver (already in use) = (مستخدم بالفعل) oreans.vxd driver لا يمكن فتح
Driver cannot be updated = Driver لا يمكن تحديث
Computer needs to be reset to install driver = driver يجب إعادة تشغيل الجهاز لتثبيت
Cannot write oreans.vxd (already in use) = (مستخدم بالفعل) oreans.vxd driver لا يمكن كتابة

Trial nag screen (reminder) = (الشاشة المزعجة للنسخة التجريبية(المذكرة
Trial days expired = عدد الأيام للنسخة التجريبية إنتهت
Trial executions expired = عدد مرات العمل للنسخة التجريبية إنتهت
Trial date expired = التاريخ للنسخة التجريبية إنتهى
Trial runtime expired = العمل للنسخة التجريبية إنتهى
Trial global time expired = الوقت العام للنسخة التجريبية إنتهى
Trial locked to different country = النسخة التجريبية مغلقة لبلدان مختلفة
Trial extension key corrupted = مفتاح الإمتداد للنسخة التجريبية تالف
No more trial extensions allowed = الإمتدادات للنسخة التجريبية لم تعد متاحة
Show registration info (only first time when registered) = (إظهر معلومات التسجيل (أول مرة فقط عند التسجيل
License days expired = عدد الأيام التصريح إنتهت
License executions expired = عدد مرات العمل بالتصريح إنتهت
License date expired = تاريخ التصريح إنتهى
License global time expired = الوقت العام للتصريح إنتهى
License key corrupted = التصريح تالف
License locked to different machine = التصريح مغلق لألة أخرى
License without machine locking = غلق التصريح بدون ألة
No more hardware changes allowed = hardware غير مسموح بالمزيد من تغييرات
Stolen license key = التصريح مسروق
License is not expirable = التصريح غير قابل لللإنتهاء
License required to run = لا يمكن العمل بدون تصريح
Trial/Licensing Manager manipulated = Trial/Licensing Manager تمت معالجة
Invalid user/password (for password dialog) = (إسم المستخدم/كلمة السر غير صحيحة (لمحادثة كلمة السر

This application(s) will run in trial/restricted mode, until registered. = هذا البرنامج سيعمل فى إطار مقيد/تجريبي، حتى التسجيل
Days Expiration = عدد الأيام قبل الإنتهاء
Date Expiration = تاريخ الإنتهاء
Executions = التنفيذات
Run Time (execution) = (توقيت العمل(التنفيذ
Global Time = التوقيت العام
days = الأيام
times = الأوقات
minutes = الدقائق
Unlimited = غير محدد
(For custom restrictions) = (من أجل قيود معينة)
Trial Restrictions = قيود التجريب
Clock Change = تغيير الساعة
Trial Extension = إمتداد للنسخة التجريبية
Lock trial to user language = إغلاق النسخة التجريبية على أساس لغة المستخدم
Allow trial period to be extended (with a valid key) = (السماح بإمداد مدة التجريب(بتصريح صحيح
Extension Key distribution options = خصائص توزيع تصاريح الإمتداد
With single file = بملف واحد
With Registry = بالتسجيل
Value Name = إسم القيمة
Maximum Extensions = الحد الأقصى للإمتدادات
Maximum extensions allowed = الحد الأقصى للإمتدادات المسموح بها

This option sets a trial period to a certain amount of days since the application is started for the first time = هذا الإختيار يحدد عدد أيام التجريب من تاريخ أول تشغيل للبرنامج
This option sets an exact date for the end of the trial period = هذا الإختيار يحدد تاريخ إنتهاء فترة التجريب
This option sets an exact number of executions allowed for an application = هذا الإختيار يحدد عدد مرات العمل المسموح بها لهذا البرنامج
This option sets an exact amount of time (in minutes) that an application can stay in memory = هذا الإختيار يحدد الوقت المسموح به(بالدقائق)لتواجد البرنامج فى الذاكرة
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions = Windows® هذا الإختيار يحدد عدد الدقائق الكلية المسموح للبرنامج العمل خلالها أثناء عمل 
This option allows an application to run in trial mode without any restrictions added by WinLicense = WinLicense هذا الإختيار يسمح للبرنامج بالعمل تجريبيآ بدون قيود مضافة من
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = سوف يتجاهل تأخير الساعة ليوم واحد WinLicense ،"ضد تغيير الساعة. مثلآ إذا إخترت "تأخير الساعة يوم واحد WinLicense يمكنك تحديد درجة حساسية
This option allows an application to be locked to specific country when it runs in trial mode = هذا الإختيار يسمح بغلق البرنامج لدولة معينة أثناء العمل كبرنامج تجريبى
This option allows you to extend the trial period of your application with special trial extension keys = هذا الإختيار يسمح بإمداد فترة التجريب للبرنامج بإستخدام تصاريح خاصة
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = ببحثها عند بداية عمل البرنامج WinLicense هذا الإختيار يحدد عدد تصاريح الإمداد ليقوم
This option is used to allow distribution of extension keys as Windows® Registry key files = Windows® Registry هذا الإختيار يسمح بتوزيع تصاريح الإمداد علي هيئة ملفات
This option limits the amount of trial extensions that an application can be extended = هذا الإختيار يحدد عدد مرات الإمداد المسموح بها للبرنامج

Any clock change = أى تغيير للساعة
1 hour clock back = تأخير الساعة ساعة واحدة
1 day clock back = تأخير الساعة يوم واحد

This application(s) can be registered, with the presence of a valid key. = .هذا البرنامج يمكن أن يكون مسجلآ عن طريق تصريخ صحيح
License Keys Accepted = تم قبول التصاريح
Types of accepted License Keys = أنواع التصاريح المقبولة
Single file = ملف واحد
Registry = التسجيل
Security Options = خيارات الأمان
Enable SmartActivate® System for user-side generated keys. = للتصاربح المولدة من قبل المستخدم SmartActivate® السماح بنظام
Allow only hardware dependent (locked) registrations. = .hardware السماح فقط بالتسجيلات المعتمدة على
Accept only temporary keys (that expire). = .(قبول التصاريح المؤقتة فقط(المنتهية
Application only runs when registered. (Requires a key to run) = .البرنامج لا يعمل الإ بعد التسجيل
Clear trial info when registered. = .مسح المعلومات التجريبية فى حالة التسجيل
License Key Signature = بصمة التصريح
Level 1 = المستوى ١
Level 2 = المستوى ٢
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = SmartActivate® هذه التقنية تسمح بتسجيل البرنامج بإستخدام تصاريح. SmartActivate® يقدم نظام WinLicense ،من أجل تحكم محترف
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = مفتاح تسجيل إلى تلك الماكنة المعيّنة WinLicense يحدّد هذا الخيار إستعمال التسجيل إلى حاسوب معيّن. بينما كلّ حاسوب له هوية ماكنة فريدة (نوع معالج، مسلسل السير الذاتية والقرص الصلب)، يمكن أن يقفل
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = لقبول مفاتيح التسجيل المؤقتة فقط WinLicense ينكر هذا الخيار إستعمال "وقت" تسجيل غير محدود و يقفل ويجبر
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = سينهي التطبيق إذا لا يوجد مفتاح  أو إذا هو تالف WinLicense .هذا الخيار يسمح للمستخدم بالعمل فقط في وجود مفتاح تسجيل صحيح
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = إنّ غرض هذا الخيار أن تتبدّد معلومات التجربة عند إستعمال مفتاح تسجيل صحيح إذا قرّر المستعمل أن يزيل التسجيل أو إنتهي، فترة التجربة ستستأنف من صفر
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = لتدقيق تلك الرخص لتطبيقاتك أصيلة WinLicense هذا الخيار يسمح لك لإختيار مستوى التوقيع مستعمل من قبل

Enable Password Protection = مكّن حماية كلمة سر
Password requirement = طلب كلمة سر
Password Action = عمل كلمة السر
Encrypt EXE using the password hash. = 
On Normal / Trial Version = على الوضع الطبيعي / نسخة تجربة
On Registered Version = على النسخة المسجّلة
Never ask for a password. = أبدا لا تطلب كلمة سر
I will ask for a password manually. = .أنا سأسأل عن كلمة سر يدويا
Automatically, ask for a password only the first time. = أوتوماتيكيا، أطلب كلمة سر فقط فى المرة الأولى
Automatically, always ask for a password. = أوتوماتيكيا، أطلب دائما كلمة سر

Hardware Lock = قفل الأجهزة
Custom Hardware Items = مواد الأجهزة مختارة
Hardware Items = مواد الأجهزة
All hardware items = كلّ مواد الأجهزة
CPU = CPU
BIOS =  BIOS
MAC Address = MAC Address
HDD Serial = HDD Serial
Allowed CPU changes = CPU إسمح بتغييرات
Allowed BIOS changes = BIOS إسمح بتغييرات
Allowed NIC changes = NIC إسمح بتغييرات
Splash settings = خصائص البقعة

Keep Trial Running = إستمرار العمل التجريبى
Keep running = إستمرار العمل
Launch Application when Trial Expired = تشغيل برنامج عند إنتهاء فترة التجريب
Launch Application = تشغيل برنامج
Application Name: = :إسم البرنامج
Enable Custom Event = السماح بحدث معين
Export Specific Generators = تصدير مولدات معينة
Event Name: = :إسم الحدث
Export Generators = تصدير المولدات
Custom Event = حدث معين
This option will export a specific license generator when your application is being protected = هذا الخيار سيصدّر مولّد رخصة معيّن متى تمت حماية البرنامج
This option will run an external application when the trial period in your application has expired. = هذا الخيار سيشغل برنامج خارجي عندما تنتهى فترة التجربة للبرتامج
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. = يمكن أن تعرّف حدث معين لإستثناء تهيئة عدّة برلمج محمية في نفس الوقت .هذا الخيار مناسب أيضا متى كان البرنامج يطلق العديد من الأوقات بالدّقيقة
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =  إختر هذا الخيار إذا أردت أنّ يستمر البرنامج بالعمل في نمط التجربة إذا كان الترخيص تالف
*** Demo Version *** = ***نسخة غير كاملة***
Destroy Exports section = تدمير قطاع التصديرات
This option will destroy the export table of your DLL control for maximum security = وذلك لزيادة الأمان DLL هذا الخيار سيدمّر جدول تصدير سيطرة
Select specific functions from your DLL to handle each event = لمعالجة كلّ حدث DLL الدوال المختارة من
DLL Control file = DLL ملف التحكم

Export specific generators to App. folder = تصدير مولدات معينة إلى مكان البرنامج
Trial in debug mode (for testing purposes) = (لأغراض الإختبار) debug نسخة تجريبية بنظام
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = إختر هذا الخيار إذا تريد خلق مولّد رخصة معين للبرنامج المحمي. المولّد سيخلق في داخل مكان البرنامج
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = قم بإزالة هذا الخيار فقط عند إصدار برنامجك المحمي. لأغراض الإختبارات، يترك هذا الخيار لتجنّب خزن المعلومات الغير ضرورية في نظامك حول حالة تجربتك

&Add = إضافة
&Edit = تعديل
&Delete = مسح
Name = الإسم
Company = إسم الشركة
Total Customers: = :إجمالى العملاء
New Customer = عميل جديد
Edit Customer = تعديل عميل
Delete Customer = مسح عميل
Customers = العملاء
Extra Details = بيانات إضافية
Add Customer = إضافة عميل
Update = تحديث
Filename = إسم الملف
Version = الإصدار
Total Software: = :إجمالى البرامج
Do you want to delete this software? = هل تريد مسح هذا البرنامج؟
Confirm = تأكيد
Add Software = إضافة برنامج
Edit Software = تعديل برنامج
Delete Software = مسح برنامج
Duplicate Software = نسخ برنامج
(leave blank to use the same input and output filename) = (إتركه فارغا لإستعمال نفس الإدخال وأنتاج اسم ملف)
Input File Type = نوع ملف الإدخال
License Unique Key = مفتاح الترخيص الوحيد
Trial Unique Key =  مفتاح التجريب الوحيد
Password Unique Key = مفتاح كلمة السر الوحيد 
Windows Standard Executable (EXE) = Windows Standard Executable (EXE)
Dynamic Link Library (DLL) = Dynamic Link Library (DLL)
OLE Control Extension (OCX) = OLE Control Extension (OCX)
Windows .NET Executable = Windows .NET Executable
Windows NT/XP Service = Windows NT/XP Service
Screensaver File (SCR) = Screensaver File (SCR)
Copy Software = نسخ نرنامج
Reg Unique Key missing. Please, select one. = مفتاح التسجيل الوحيد مفقود. من فضلك إختر واحدآ
Software Manager = مدير البرامج
Sofware name missing. Please, select one. = إسم البرنامج مفقود. من فضلك إختر واحدآ
Reg Unique Key is too short. Please, select a new unique key. = مفتاح التسجيل الوحيد قصير جدا.من فضلك إختر مفتاح جديد
Trial Unique Key missing. Please, select one. = مفتاح التجريب الوحيد مفقود. من فضلك إختر واحدآ
Trial Unique Key is too short. Please, select a new unique key. = مفتاح التجريب الوحيد قصير جدا.من فضلك إختر مفتاح جديد
Pass Unique Key missing. Please, select one. = مفتاح العبور الوحيد مفقود. من فضلك إختر واحدآ
Pass Unique Key is too short. Please, select a new unique key. = مفتاح العبور الوحيد قصير جدا.من فضلك إختر مفتاح جديد
The software already exists in database. Please, choose a new software name or version. =  البرنامج موجود في قاعدة البيانات. رجاء،إختر اسم أو نسخة برنامج جديدة
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = جديد.إستكمال؟ hash جديدة سيخلق. التراخيص المولّدة السابقة سوف لن تعمل إذا نم تخليق License Hash
Duplicated Software = برنامج منسوخ 
File cannot be opened. Make sure the application is not running or being used. = الملف لا يمكن أن يفتح. تأكّد البرنامج لا يعمل أو  مستعمل
Protection Error = خطأ حماية
Protect Error = إحم خطأ
File is compressed or already protected. = الملف مضغوط أو محمي
File has a missing macro START or END. Please correct this error before protecting. =  مفقودة فى الملف. رجاء صحّح هذا الخطأ قبل الحماية START أو END macro
File cannot be opened. Make sure that other application is not using it. = الملف لا يمكن أن يفتح. تأكّد بأنّ البرنامج الآخر لا يستعمله
File has an invalid PE header. Unable to protect. = غير صحيح و لا يمكن حمايته PE header الملف له
File contains one macro with few lines of code on it. Please review your macros before protecting. = قبل الحماية macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
File seems to be in use. Please, close the file to proceed with protection. = يبدو الملف قيد الإستعمال. رجاء، إغلق الملف للإستمرار بالحماية
The splash file does not exist. = ملف البقعة غير موجود
Splash = البقعة
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = فقط يتم عرضها بشكل صحيح BMP 256 ملف الصورة لا يحتوى على 256 لون.ملفات
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = الغير مضغوطة فقط يتم عرضها بشكل صحيح BMP مضغوط.ملفات BMP ملف الصورة
Do you want to cancel the protection process? = تريد إلغاء عملية الحماية؟
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = لا يمكن فتح الملف المراد حمايته للكتابة. رجاء، تتأكّد أنّ الملف ليس مستعمل أو يعمل. الحماية ألغيت
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = لا يمكن كتابة الملف المحمي إلى القرص. رجاء، تتأكّد بأنّك عندك سماح بالكتابة والفضاء الكافي في قرصك
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode =  الغير كاملة تسمح للحماية فقط بالتجربة / بالترخيص فى نظام التصحيح WinLicense عفوآ ،نسخة
WinLicense DEMO = نسخة غير كاملة WinLicense

&Add License = إضافة تصريح
&Edit License = تعديل تصريح
&Delete License = مسح تصريح
Create License Key = إنشاء تصريح
Mark as Stolen = تحديد كمسروق
Unmark Stolen = إزالة التحديد كمسروق
Stolen = مسروق
Ban Hardware IDs = المحظورة Hardware IDs
Please make a selection... = ...من فضلك إختر
License Details = بيانات التصريح
License Generation = توليد التصريح
Hardware ID = Hardware ID
Custom Data = بيانات محددة
Key Type = نوع المفتاح
Country Locking = قفل البلاد
Store generated Licenses in folder: = :إحفظ التراخيص المولدة في حافظة
Generate File Key = ولّد مفتاح ملف
Generate Registry Key = ولّد مفتاح تسجيل
Generate Text Key = ولّد مفتاح نصى
Generate SmartActivate Key = SmartActivate ولّد مفتاح

Total Software: = :البرامج الكليّة
All = الكل
Please make a selection... = ...من فضلك إختر
Nothing selected. = لا شيء مختار
Selection: = :الإختيار
Software: = :البرنامج
Do you want to mark the current key as stolen? = هل تريد تأشير المفتاح الحالي كمسروق؟
Stolen Keys = المفاتيح المسروقة
Do you want to unmark the current key from being stolen? = هل تريد إزالة تأشير المفتاح الحالي كمسروق؟
Do you want to delete this license? = هل تريد أن تحذف هذه الرخصة؟
Warning: The generated keys will have the settings from the current project. Proceed? = تحذير: المفاتيح المولّدة سيكون لها خصائص من المشروع الحالي. إستكمال؟
Generate License = ولّد رخصة
Cannot create directory: = :لا يستطيع خلق الحافظة
Please, select which type of license you want to generate = رجاء، إختار نوع الرخصةالتي تريد توليدها
Keys successfully generated in folder: = :ولّدت المفاتيح بنجاح في الحافظة
Please, first select a valid application to protect = رجاء، إختار أولا برنامج صحيح للحماية
Ban Hardware Id = المحظورة Hardware Id

License Restrictions = قيود الرخصة
Customer = العميل
Software = البرنامج
Save = حفظ
Edit License = تعديل رخصة
Add License = أضافة رخصة
Please, select a customer from database. = رجاء، إختار عميل من قاعدة البيانات
License Manager = مدير التراخيص
Please, select a software from database. = رجاء، إختار برنامج من قاعدة البيانات
Please, insert a Hardware ID for verification = للتحقّق Hardware ID رجاء، إدخال
The inserted Hardware ID is valid = المدخلة صحيحة Hardware ID
Invalid Hardware ID inserted = المدخلة غير صحيحة Hardware ID
Another instance of WinLicense is running = يعمل بالفعل WinLicense
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = أخيرا SmartActivate لتركيب مفتاح Wlregsmartkeyinstalltoregistry أو Wlregsmartkeyinstalltofile لكنّك لم تختر أيّ نوع من الرخص سيكون مقبولا(ملف أو تسجيل) تذكّر بأنّك يجب أن تستعمل SmartActivate لقد مكّنت مفاتيح
File has not being simulated: = :الملف لم يحاكى
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = "رجاء حاك الملف قبل الحماية أو أزل الإختيار"محاكاة  قبل حماية
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = تحذير: البرنامج أسّس لكي يسجّل مع مفتاح رخصة صحيح، لكنّك لست مختار بأية طريقة سيكون التسجيل. البرنامج لن يكون قادر على أن يكون مسجّل. الإستكمال؟
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = تحذير: البرنامج أسّس لكي يمتدّ بمفتاح إمتداد تجريبى، لكنّك لست مختار بأية طريقة سيكون إمتداد فترة التجربة. البرنامج  لن يكون قادر على أن يكون ممتد. الإستكمال؟
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = البرنامج؟ header أن يعيد بناء WinLicense هل تريد .WinLicense البرنامج غير متوافق مع header
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = إستكمال؟. .NET لدعم WinLicense Professional تحتاج للتحديث إلى. .NET لا يستطيع حماية الملفات WinLicense Standard ،عفوآ
Note: CodeReplace has been added into your application = إلى البرنامج CodeReplace ملاحظة:أضيف
(Application header has been rebuilt by WinLicense) = (WinLicense البرنامج أعيد بناء من قبل header)
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = .لحماية هذا البرنامج WinLicense x32 أنت محتاج .x64 خطأ: البرنامج المختار ليس برنامج
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = .لحماية هذا البرنامج WinLicense x64 أنت محتاج .x64 خطأ: البرنامج المختار برنامج
Sorry, the MAP file was not found: = لم يوجد MAP عفوآ، ملف
Please, generate a MAP file for your application = للبرنامج MAP رجاء، توليد ملف
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = Visual Basic Pcode فى برامج CodeReplace لا يدعم WinLicense عفوآ، الإصدار الحالى من
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = .NET فى برامج CodeReplace لا يدعم WinLicense عفوآ، الإصدار الحالى من
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = نفّذت بعض الدوال إلى حد كبير والبعض ليسوا منفّذين في المحاكاة. هل تريد إلى غير منتقاة تلك الدوال؟
There are some functions highly executed in simulation. Do you want to unselect those functions? = نفّذت هناك بعض الدوال إلى حد كبير . هل تريد إلى غير منتقاة تلك الدوال؟
There are some functions not executed in simulation. Do you want to unselect those functions? = نفّذت هناك بعض الدوال  ليسوا منفّذين في المحاكاة. هل تريد إلى غير منتقاة تلك الدوال؟
Messages exported to: = :صدّرت الرسائل إلى
Messages imported from: = :الرسائل إستوردت من
WinLicense GUI Overview = WinLicense GUI حول
Trial Settings = الإعدادات التجريبية
Trial SDK = التجريبية SDK
Registration SDK = التسجيل SDK
Password Protection = حماية كلمة السر
Miscellaneous SDK = متنوع SDK
Hardware Lock = قفل الأجهزة
WARNING: Protected in Trial Debug Mode = التجريبى Debug تحذير: محمي في نظام
Click and select here = أنقر وإختر هنا
ERROR: None of the functions handlers where specified in DLL Control = DLL خطأ: لا أحد من عمال الدوال حدّدوا في سيطرة
Sorry, WinLicense DEMO does not support RISC-128 processors = RISC-128 لا يدعم معالجات WinLicense DEMO ، عفوآ
Sorry, WinLicense DEMO does not support Dynamic Opcodes = الديناميكية Opcodes لا يدعم معالجات WinLicense DEMO ، عفوآ
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = للبرنامج License Hash وتعيد إنشاء Sofware Panel المستوى ٢ لم يقبل للبرنامج الحالي. رجاء، تذهب إلى
.NET Module = .NET وحدة
File has a missing macro START or END. Please review your macros again: = :ثانية macros مفقودة فى الملف.رجاء راجع START أو END macro
File cannot be opened. Make sure that other application is not using it: = الملف لا يمكن أن يفتح. تأكّد بأنّ البرنامج الآخر لا يستعمله
File has an invalid PE header. Unable to inspect file: = :تالف. لا يمكن فحص الملف PE heade الملف المراد حمايته يحتوى على
File contains one macro with few lines of code on it. Please review your macros again: = :ثانية macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
Deep file analysis in progress = تحليل الملف العميق يعمل
File analysis in progress = تحليل الملف يعمل
Please wait... = ...الرجاء الإنتظار
Analyzing CodeReplace macros = CodeReplace macros تحليل
Are you sure you want to remove the selected Hardware ID? = المختار؟ Hardware ID أنت متأكّد تريد أن تزيل
List of Banned  Hardware IDs: = :الممنوعة Hardware IDs قائمة
Add = إضافة
Remove = إزالة
Done = تم
Generating License Hash = License Hash توليد
Generate Password = ولّد كلمة سر
Password Generation = توليد كلمة سر
Store generated Passwords in folder: = :حفظ كلمات السر المولدة في الحافظة
Total Passwords: = :كلمات السر الكليّة
Do you want to delete the selected record? = هل تريد حذف السجل المختار؟
Password file generated in folder: = :ملف كلمة سر ولّد في الحافظة
Password Generator = مولّد كلمة السر
Password Manager = مدير كلمة السر
Details = التفاصيل

Add Password = أضف كلمة سر
Edit Password = تعديل كلمة سر
Please, select a customer to generate the password = رجاء، تختار عميل لتوليد كلمة السر
Please, select a software to generate the password = رجاء، تختار برنامج لتوليد كلمة السر
Rolling back your actions = تقليل أعمالك

Generate Extension = ولّد إمتداد
Level = المستوى
Trial Extension Generation = توليد الإمتدادات التجريبية
Store generated Extensions in folder: = :حفظ الإمتدادات المولدة في الحافظة
Generate File Key = ولّد مفتاح ملف
Generate Registry Key = ولّد مفتاح تسجيل
Trial extension key/s generated in folder: = :مفاتيح الإمتدادات التجريبية ولّدت في الحافظة 
Trial Extension Generator = مولّد إمتداد تجريبى
Edit = تعديل
Add Trial Extension = أضف إمتداد تجريبى
Edit Trial Extension = تعديلإمتداد تجريبى
Please, select a software to generate the trial extension = رجاء، تختار برنامج لتوليد الإمتداد التجريبى

Warning: Trial in Debug Mode = debug تحذير: نسخة تجريبية بنظام
Debug Mode Trial = debug نسخة تجريبية بنظام
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = .SecureEngine Trial Storing Manager* البرنامج الذى ستحميه لن يتضمّن
The trial information will be stored under the registry key: = :معلومات التجربة ستخزن تحت مفتاح التسجيل
(You can access to that key to reset/test the WinLicense Trial Engine) = (WinLicense يمكن أن تدخل إلى ذلك المفتاح لإعادة / لإختبر محرّك تجربة)
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = في شاشة الحماية "debug قم بإزالة الإختيار"نسخة تجريبية بنظام ، SecureEngine Trial Storing Manager لتمكين
Don't show this screen again = لا تظهر هذه الشاشة ثانية

Do you want to delete the selected client? = هل تريد حذف العميل المختار؟
Enter new Hardware ID to ban: = :جديد للمنع Hardware ID إدخل
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = صحيحة Hardware ID الداخلة لا تبدو صحيحة(يجب أن تكون على الأقل ٣٢ حرف)ي.رجاء، إدخالHardware ID

File has a missing macro START or END. Please correct this error before protecting: = :مفقودة فى الملف. رجاء صحّح هذا الخطأ قبل الحماية START أو END macro
File has an invalid PE header. Unable to protect: = :غير صحيح و لا يمكن حمايته PE header الملف له
File contains one macro with few lines of code on it. Please review your macros before protecting: =  :macros واحدة ذات عدد سطور قليل.من فضلك راجع macro الملف المراد حمايته يحتوى على
The input file seems to be in use. Please, close the file to proceed with protection: = :يبدو الملف قيد الإستعمال. رجاء، إغلق الملف للإستمرار بالحماية

Code Virtualization = إفتراضية الكود
Virtual Opcodes Obfuscation = المفترضة Opcodes تشويش
Current: = :الحالى
Virtual Machine Complexity = درجة تعقيد الألة الوهمية
Size (Approx): = :(الحجم (بالتقريب
Opcodes Mutation = Opcodes تغير
Multiple Virtual Machines = المكائن الإفتراضية المتعدّدة
NumVMs * SizeVM: = حجم الألة الوهمية  * عدد الألات الوهمية
Fake Stack Emulation = مزيفة Stack محاكاة
Strip Relocations (EXEs) = (EXEs) إنتقال شريط
Strip relocations = إنتقال شريط
Re-Virtualization = Re-Virtualization
Multi Branch Technology = تقنية تعدد الأفرع
Fake Emulation = المحاكاة الخداعية
Keep original name = أحتفظ بالإسم الأصلى
Functions that will be virtualized: = :الدوال التى ستحول إلى إفتراضية

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = على التعقيد الذي تختار opcodes المولّدة. يعتمد حجم opcodes يمكن أن تفصّل كم تعقد
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = يمكن أن تفصّل كم تعقد الماكنة الإفتراضية المولّدة. يعتمد حجم الماكنة الإفتراضية على التعقيد الذي تختار
You can mutate the internal virtual opcodes, generating a more complex virtual machine = الإفتراضية الداخلية، مولدآ ماكنة إفتراضية أكثر تعقيدا opcodes يمكن أن تبدّل
The generated Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = سيوضع داخل القسم الأخير من تطبيقك. يمكن أن تبدّل إسم القسم الأخير من تطبيقك كما هو مطلوب opcodes الماكنة الإفتراضية المولّدة و
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = يمكن أن تخلق عدّة مكائن إفتراضية داخل تطبيقك المحمي. كلّ ماكنة إفتراضية ستعالج كتل معيّنة من الكود في تطبيقك
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = PureBasic هذا الخيار يجب أن يمكّن لتطبيقات.stack معرفة لصفر لكلّ المداخل الغير مخصّصة في stack هذا الخيار سيفترض
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = مخفّضآ حجم التطبيق المحمي النهائي ،EXE لملفات PE header يمكن أن تزيل مقطع الإنتقال من
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization = Re-Virtualization تقنية قويّة جدا ضدّ الهندسة العكسية. لكنّه يمكن أن ينقص الكثير في السرعة في الكتل المحمية. رجاء، تدقّق أداء تطبيقك عندم الحماية مع Re-Virtualization
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = داخل الألة الوهمية مما يجعلها أصعب فى التحليل conditional branch هذا الإختيار يزيد تعليمات

Please, select an application to protect = رجاء، تختار برنامجا للحماية
The selected application does not have any functions to virtualize. Please insert functions using the SDK = SDK البرنامج المختار لا يحتوى أيّ دوال للإفتراضية. رجاء أدخل الدوال مستخدمآ
All functions to virtualize were disabled. Please, select at least one = كلّ الدوال المراد إفتراضيتها عطّلت. رجاء، تختار على الأقل واحدة
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = macro أو تراجع كل compiler رجاء، توقف تحقيق أمثلية.compiler بدون كود داخلها.هذا قد بسبب تحقيق أمثلية macro تحذير!وجد
Virtual Functions = الدوال المفترضة
Inserted via "Call VarPtr": = :"Call VarPtr" أدخل عن طريق
Inserted via inline Assembly: = :inline Assembly أدخل عن طريق
Inserted via auxiliar API: = :مساعد API أدخل عن طريق
Inserted via MAP file: = :MAP أدخل عن طريق ملف
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = !!!لا دوال وجدت للإفتراضية
(Application header has been rebuilt by Code Virtualizer) = (Code Virtualizer البرنامج أعيد بناءه بواسطة header)
Protecting an Application = حماية برنامج
Learn About Virtualizer = Virtualizer إعلم حول
Code Virtualization = Code Virtualization
Code Virtualize Macros = Code Virtualize Macros
**** Sorry, the DEMO version does not support protection via command line **** = ****command line عفوآ، لنسخة الغير كاملة لا تدعم الحماية من خلال***
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = *** (خطأ: الملف المراد حمايته لا يمكن الوصول إليه. (رمز خروج ٢ ***
*** ERROR: File does not have any blocks to protect. (Exit code 3) *** = *** (خطأ: الملف ليس به أيّ كتل للحماية. (رمز خروج ٣ ***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = *** (خطأ: الملف المراد حمايته لا يمكن أن يفتح. (رمز خروج ٥ ***
Generating Specific Virtual Machine = توليد الماكنة الإفتراضية المعيّنة
Virtualizing Function = إفتراض الدوال
Re-Virtualizing ... = ...Re-Virtualizing
Flushing file ... = ...تدفّق الملف
Sorry, the DEMO version only allows one Virtual Machine per application = عفوآ، لنسخة الغير كاملة تسمح لماكنة إفتراضية واحدة فقط لكلّ تطبيق
Sorry, the DEMO version does not support Re-Virtualization = Re-Virtualization عفوآ، لنسخة الغير كاملة لا تدعم 
The application is already protected. You cannot protect an already protected application in the DEMO version = البرنامج محمى. لا تستطيع حماية برنامج محمي في نسخة الغير كاملة
The Input application cannot be accessed. Please, check that the application is not in use: = :برنامج الإدخال لا يمكن لوصول إليه. رجاء، التأكّد أنّ البرنامج ليس قيد الإستعمال
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = :البرنامج الناتج لا يمكن الوصول إليه. رجاء، التأكّد أنّ مسار البرنامج صحيح أو الملف ليس قيد الإستعمال
Limitations in DEMO version: = :تقييدات في النسخة الغير كاملة
Virtual Opcodes Obfuscation set to NORMAL = الإفتراضي قرّر وضع طبيعي Opcodes تشويش
Virtual Machine Complexity set to NORMAL = تعقيد الماكنة الإفتراضي قرّر وضع طبيعي
Only ONE macro is virtualized = واحدة فقط macro تم إفتراض
The Output application cannot be accessed. Please, check that the application is not in use: = :البرنامج المحرج لا يمكن الوصول إليه.تأكد أنه غير مستخدم
PE Information = :PE معلومات
Input PE file: = :الإدخال PE ملف
Output PE file: = :الإخراج PE ملف
Virtual Functions found: = :الدوال الإفتراضبة المكتشفة
PE file analysis... OK! = !تمت...PE تحليلات ملف
Virtualization = الإفتراض
Generating Specific Virtual Machine = توليد ألة وهمية دقيقة
Size: = :الحجم
Virtualizing Function = إفتراض الدوال
Start: = :البداية
Skipped = المتخطى
bytes = bytes
Cancelling... = ...يتم الإلغاء
Re-Virtualization = Re-Virtualization
Re-Virtualizing ... = ...Re-Virtualizing
Final Stats = الحالات النهائية
Virtualized Functions: = :الدوال التى أصبحت إفتراضية
Skipped Functions: = :الدوال التى تم تخطيها
Errors: = :الأخطاء
Increase in size: = :الزيادة فى الحجم
Application successfully protected! = !تم حماية البرنامج بنجاح
Protection CANCELLED! = !تم ألغاء الحماية
Do you really want to Cancel the protection process? = هل ترغب فى إلغاء عملية الحماية؟
Cancel Protection = إلغاء الحماية
Select a Software to protect from the WinLicense database = WinLicense إختر برنامج للحماية من قاعدة بيانات


Anti-Debugger Detection = 
Advanced = 
Disable = 
Level 1 = 
Level 2 = 
File Patch (sign support) = 
Detect any change = 
Allow 1 hour back = 
Allow 1 day back = 
Allow clock changes = 
External Hardware = 
U3 USB device = 
(not Windows 9x/Me compatible) = 
Periodically check U3 device = 
The U3 USB device will be monitored to check if it's unplugged. The function WLHardwareRuntimeCheckU3 checks if the device is present or not at any time. = 
Checking U3 USB device = 
Network Instances: No more Allowed = 
Network Instances: Server not running = 
** Not available in current version ** = 
License installation time-limit exceeded = 
License disabled in current instance = 
Control Messages from external DLL = 
Select a DLL that will handle the displaying of each message. If no DLL is selected, Themida will display the above messages in a MessageBox =  
Functions Handlers = 
Select the function in your DLL that will handle the protection messages = 
Select the DLL that will handle all WinLicense events = 
Hide from PE scanners = 
Type 1 = 
Type 2 = 
Localization = 
Add Manifest = 
Don't add manifest = 
Add Custom manifest = 
MSVC80 manifest = 
XP Themes = 
MSVC90 manifest = 
Launch Application = 
This option will run an external application when the trial period in your application has expired. = 
Delete extracted on exit = 
Open Project = 
Description = 
Saved Projects = 
Date Created = 
Delete = 
Open = 
Reset Trial = 
Reset Trial in current machine = 
Search = 
Search Next = 
Install Before Date = 
Network Instances = 
Instances = 
Store Creation Date = 
Embed user info in key =  
(only for Dynamic SmartKeys) = 
Generate Dynamic SmartKey = 
Default License generation folder = 
License Restrictions = 
Miscellaneous = 
Search Details = 
Search by: = 
Search for: = 
Customer Name = 
GetPrivateProfile APIs support = 